Run/Base_Cases_Run_800_um/Base_Case_Run/CFD/system/FOFieldMinMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Field Min and Max.

\*---------------------------------------------------------------------------*/
minMaxU
{
	type            fieldMinMax;
	functionObjectLibs            ("libfieldFunctionObjects.so");

	fields
	(
	U
	);

	mode    magnitude;
	outputControl timeStep;
	OutputInterval 1;
}
// ************************************************************************* //

